damianbubak92/bramka-setup/Gateway/Firmware/M4F/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62x" --part "Default" --package "ALW" --context "m4fss0-0" --product "MCU-PLUS-SDK-AM62X@12.00.00"
 * @v2CliArgs --device "AM625-Q1" --package "FCBGA (ALW)" --variant "AM6254-G" --context "m4fss0-0" --product "MCU-PLUS-SDK-AM62X@12.00.00"
 * @versions {"tool":"1.26.2+4477"}
 */

/**
 * Import the modules used in this configuration.
 */
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const ipc             = scripting.addModule("/drivers/ipc/ipc");
const mcspi           = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1          = mcspi.addInstance();
const addr_translate  = scripting.addModule("/kernel/dpl/addr_translate", {}, false);
const addr_translate1 = addr_translate.addInstance();
const addr_translate2 = addr_translate.addInstance();
const addr_translate3 = addr_translate.addInstance();
const addr_translate4 = addr_translate.addInstance();
const addr_translate5 = addr_translate.addInstance();
const addr_translate6 = addr_translate.addInstance();
const addr_translate7 = addr_translate.addInstance();
const addr_translate8 = addr_translate.addInstance();
const clock           = scripting.addModule("/kernel/dpl/clock");
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
gpio1.$name                    = "SPI_MASTER_READY";
gpio1.pinDir                   = "OUTPUT";
gpio1.MCU_GPIO.gpioPin.$assign = "MCU_MCAN1_TX";

gpio2.$name                    = "SPI_SLAVE_READY";
gpio2.trigType                 = "FALL_EDGE";
gpio2.MCU_GPIO.gpioPin.$assign = "MCU_MCAN1_RX";

ipc.vringAllocationPDK = false;

mcspi1.$name                           = "CONFIG_MCSPI0";
mcspi1.transferMode                    = "CALLBACK";
mcspi1.transferCallbackFxn             = "spiMcspiCallback";
mcspi1.MCU_SPI.$assign                 = "MCU_SPI0";
mcspi1.MCU_SPI.CLK.$assign             = "MCU_SPI0_CLK";
mcspi1.MCU_SPI.D0.$assign              = "MCU_SPI0_D0";
mcspi1.MCU_SPI.D1.$assign              = "MCU_SPI0_D1";
mcspi1.mcspiChannel[0].$name           = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].frameFormat     = "POL0_PHA1";
mcspi1.mcspiChannel[0].MCU_CSn.$assign = "MCU_SPI0_CS1";

addr_translate1.$name     = "CONFIG_ADDR_TRANSLATE_REGION0";
addr_translate1.localAddr = 0x80000000;
addr_translate1.size      = 28;

addr_translate2.$name      = "CONFIG_ADDR_TRANSLATE_REGION1";
addr_translate2.systemAddr = 0x90000000;
addr_translate2.localAddr  = 0x90000000;
addr_translate2.size       = 28;

addr_translate3.$name      = "CONFIG_ADDR_TRANSLATE_REGION2";
addr_translate3.localAddr  = 0xA0000000;
addr_translate3.systemAddr = 0xA0000000;
addr_translate3.size       = 28;

addr_translate4.$name      = "CONFIG_ADDR_TRANSLATE_REGION3";
addr_translate4.localAddr  = 0xB0000000;
addr_translate4.systemAddr = 0x20000000;
addr_translate4.size       = 28;

addr_translate5.$name      = "CONFIG_ADDR_TRANSLATE_REGION4";
addr_translate5.systemAddr = 0x30000000;
addr_translate5.localAddr  = 0xC0000000;
addr_translate5.size       = 28;

addr_translate6.$name      = "CONFIG_ADDR_TRANSLATE_REGION5";
addr_translate6.size       = 28;
addr_translate6.systemAddr = 0x40000000;
addr_translate6.localAddr  = 0xD0000000;

addr_translate7.$name      = "CONFIG_ADDR_TRANSLATE_REGION6";
addr_translate7.size       = 28;
addr_translate7.localAddr  = 0x60000000;
addr_translate7.systemAddr = 0x60000000;

addr_translate8.$name      = "CONFIG_ADDR_TRANSLATE_REGION7";
addr_translate8.localAddr  = 0x70000000;
addr_translate8.systemAddr = 0x70000000;
addr_translate8.size       = 28;

debug_log.enableCssLog            = false;
debug_log.enableUartLog           = true;
debug_log.uartTrace               = true;
debug_log.uartLog.$name           = "CONFIG_UART0";
debug_log.uartLog.readMode        = "CALLBACK";
debug_log.uartLog.readCallbackFxn = "uart_echo_read_callback";

mpu_armv71.$name        = "CONFIG_MPU_REGION0";
mpu_armv71.allowExecute = false;
mpu_armv71.attributes   = "Device";

mpu_armv72.$name    = "CONFIG_MPU_REGION1";
mpu_armv72.baseAddr = 0x80000000;
mpu_armv72.size     = 31;

mpu_armv73.$name = "CONFIG_MPU_REGION2";
mpu_armv73.size  = 18;

mpu_armv74.$name        = "CONFIG_MPU_REGION3";
mpu_armv74.baseAddr     = 0x9C800000;
mpu_armv74.size         = 23;
mpu_armv74.allowExecute = false;
mpu_armv74.attributes   = "NonCached";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio1.MCU_GPIO.$suggestSolution                 = "MCU_GPIO0";
gpio2.MCU_GPIO.$suggestSolution                 = "MCU_GPIO0";
debug_log.uartLog.MCU_UART.$suggestSolution     = "MCU_USART0";
debug_log.uartLog.MCU_UART.RXD.$suggestSolution = "MCU_UART0_RXD";
debug_log.uartLog.MCU_UART.TXD.$suggestSolution = "MCU_UART0_TXD";
